:PROPERTIES:
:ID:       a8fd60f6-c199-4fa2-8c49-4e44f922d1d2
:END:
Basic server.
* Files
** root
:PROPERTIES:
:ID:       39d28645-0097-4fc3-b109-96909adc7ba0
:tangle-dir: ../../../../projects/go-app
:END:
#+begin_src go :noweb yes :tangle (org-in-tangle-dir "main.go") :mkdirp yes :exports both
package main

import (
	"fmt"
	"time"
)

func main() {
	fmt.Println("Current Time:", time.Now())
}
#+end_src

#+RESULTS:
: Current Time: 2022-04-28 23:36:55.999824312 +0530 +0530 m=+0.000018291
